----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/1_merge.log
  log type:  text
 opened on:  25 Jul 2025, 23:40:28

. 
. 
. ***********************************************
. * get variable in interest from different dataset
. ***********************************************
. 
. *** use ppathl file as master file ***
. * use "${IN_DATA}ppathl.dta", clear
. use pid syear hid sex gebjahr migback using "${IN_DATA}ppathl.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. * keep data after 1992
. keep if syear >= 1992
(131,806 observations deleted)

. * replace negative value with missing
. replace sex = . if sex < 0
(1,002 real changes made, 1,002 to missing)

. replace gebjahr = . if gebjahr < 0
(7,406 real changes made, 7,406 to missing)

. replace migback = . if migback < 0
(631 real changes made, 631 to missing)

. * generate age, only keep age greater than or equal to 16
. gen age = syear - gebjahr
(7,406 missing values generated)

. gen age_square = age^2
(7,406 missing values generated)

. keep if age >= 16
(275,148 observations deleted)

. * save data ppathl
. save "${OUT_DATA}ppathl.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/ppathl.dta saved

. 
. 
. *** get variables from pgen ***
. use pid hid syear pgfamstd pgemplst pgbilzeit pgpbbil01 pglabnet pgexpft pgexppt using
>  "${IN_DATA}pgen.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. keep if syear >= 1992
(91,871 observations deleted)

. * maritial status pgfamstd
. gen married = .
(708,341 missing values generated)

. replace married = 0 if pgfamstd > 0
(705,388 real changes made)

. replace married = 1 if pgfamstd ==1
(412,996 real changes made)

. drop pgfamstd

. * employment percentage pgemplst
. gen employment_percentage = ""
(708,341 missing values generated)

. replace employment_percentage = "less than part-time" if pgemplst >0
variable employment_percentage was str1 now str19
(707,862 real changes made)

. replace employment_percentage = "full-time" if pgemplst == 1
(276,459 real changes made)

. replace employment_percentage = "part-time" if pgemplst == 2
(83,853 real changes made)

. drop pgemplst

. * education in years pgbilzeit
. gen education_years = .
(708,341 missing values generated)

. replace education_years = pgbilzeit if pgbilzeit > 0
(664,570 real changes made)

. drop pgbilzeit

. * vocational training degree pgpbbil01 
. * change to boolean?
. gen vocational_degree = .
(708,341 missing values generated)

. replace vocational_degree = 1 if pgpbbil01>0
(430,230 real changes made)

. replace vocational_degree = 0 if pgpbbil01 == -2
(273,704 real changes made)

. drop pgpbbil01

. * current net labor income pglabnet
. gen labor_income = .
(708,341 missing values generated)

. replace labor_income = 0 if pglabnet==-2
(287,141 real changes made)

. replace labor_income = pglabnet if pglabnet >= 0
(415,914 real changes made)

. drop pglabnet

. 
. * years of employment
. gen years_employ = pgexpft + pgexppt

. replace years_employ = . if years_employ == -2
(14,567 real changes made, 14,567 to missing)

. drop pgexpft pgexppt

. 
. * save data pgen
. save "${OUT_DATA}pgen.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/pgen.dta saved

. 
. 
. *** get variables from pl ***
. * use "${IN_DATA}pl.dta", clear
. use pid hid syear plb0057_h1 using "${IN_DATA}pl.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. keep if syear >= 1992
(91,916 observations deleted)

. * generate type_employment based on plb0057_h1
. gen type_employment = .
(700,011 missing values generated)

. replace type_employment = 0 if plb0057_h1 > 0
(41,127 real changes made)

. replace type_employment = 1 if plb0057_h1 == -2
(658,778 real changes made)

. drop plb0057_h1

. save "${OUT_DATA}pl.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/pl.dta saved

. 
. *** get variables from pbrutto ***
. use pid syear stell_h using "${IN_DATA}pbrutto.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. * drop individuals without relationship to the household head
. drop if stell_h < 0
(7,509 observations deleted)

. * household head
. gen hh_head = (stell_h == 0)

. drop stell_h

. save "${OUT_DATA}pbrutto.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/pbrutto.dta saved

. 
. 
. 
. *** get variables from hl ***
. * not from kidlong (k_nrkid)
. * number of children , savings amount, if savings
. //use "${IN_DATA}hl.dta", clear
. use hid syear hlc0043 hlk0044_v1 hlc0119_v1 hlc0119_v2 hlc0119_v5 hlc0120_h using "${I
> N_DATA}hl.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. * number of children hlc0043 hlk0044_v1
. gen nchild = .
(449,274 missing values generated)

. replace nchild = 0 if hlc0043 == -2
(227,479 real changes made)

. replace nchild = hlc0043 if hlc0043 >= 0
(156,342 real changes made)

. replace nchild = 0 if hlk0044_v1 == 2
(72,475 real changes made)

. drop hlc0043 hlk0044_v1

. * if_savings 
. gen if_savings_temp = .
(449,274 missing values generated)

. replace if_savings_temp = hlc0119_v1 if syear >=1992 & syear <=2014
(259,016 real changes made)

. replace if_savings_temp = hlc0119_v2 if syear >=2015 & syear <=2020
(111,362 real changes made)

. replace if_savings_temp = hlc0119_v5 if syear >=2021 & syear <=2022
(34,515 real changes made)

. replace if_savings_temp = -10 if if_savings_temp ==.
(44,381 real changes made)

. gen if_savings = .
(449,274 missing values generated)

. replace if_savings = 0 if if_savings_temp >= 2
(141,836 real changes made)

. replace if_savings = 1 if if_savings_temp == 1
(180,380 real changes made)

. drop if_savings_temp hlc0119_v1 hlc0119_v2 hlc0119_v5

. * savings amount hlc0120_h
. rename hlc0120_h savings_amount

. replace savings_amount = . if savings_amount < 0
(183,185 real changes made, 183,185 to missing)

. * harmonize if_savings and savings_amount
. replace if_savings = 1 if missing(if_savings) & (savings_amount > 0 & !missing(savings
> _amount))
(58,250 real changes made)

. replace if_savings = 0 if missing(if_savings) & (savings_amount== 0 & !missing(savings
> _amount))
(998 real changes made)

. replace savings_amount = 0 if if_savings == 0 & missing(savings_amount)
(108,362 real changes made)

. //gen test_savings = .
. //replace test_savings = 1 if savings_amount > 0 & savings_amount != .
. //replace test_savings = 0 if savings_amount == 0 & savings_amount != .
. * save data hl
. save "${OUT_DATA}hl.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/hl.dta saved

. 
. 
. *** get variables from hgen ***
. *   monthly household net income
. use "${IN_DATA}hgen.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. use hid syear hghinc using "${IN_DATA}hgen.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. keep if syear >= 1992
(44,381 observations deleted)

. gen household_income = .
(404,893 missing values generated)

. replace household_income = hghinc if hghinc < -10
(2 real changes made)

. replace household_income = hghinc if hghinc >= 0
(382,597 real changes made)

. drop hghinc

. save "${OUT_DATA}hgen.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/hgen.dta saved

. 
. *** get variables from hbrutto ***
. use hid syear hhgr using "${IN_DATA}hbrutto.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. * drop household without household size (<0) or dissolved (=0)
. drop if hhgr <= 0
(4,263 observations deleted)

. * household size
. rename hhgr hh_size

. save "${OUT_DATA}hbrutto.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/hbrutto.dta saved

. 
. *** hpathl
. use hid syear using "${IN_DATA}hpathl.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. label language EN

. save "${OUT_DATA}hpathl.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/hpathl.dta saved

. 
. 
. *** get variables from equiv ***
. use pid syear y11101 using "${IN_DATA}pequiv.dta", clear
(PreWghts: SOEP-Core, v39 (EU Edition), doi:10.5684/soep.core.v39eu)

. rename y11101 CPI

. drop if CPI < 0 //drop missing values
(11,824 observations deleted)

. save "${OUT_DATA}pequiv.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/pequiv.dta saved

. 
. 
. 
. 
. ***********************************************
. * merge
. ***********************************************
. * individual level data
. use "${OUT_DATA}ppathl.dta", clear

. merge 1:1 pid syear using "${OUT_DATA}pl.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                       252,945
        from master                   252,943  (_merge==1)
        from using                          2  (_merge==2)

    matched                           700,009  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(252,945 observations deleted)

. drop _merge

. 
. merge 1:1 pid syear using "${OUT_DATA}pgen.dta"
(note: variable syear was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         8,332
        from master                         0  (_merge==1)
        from using                      8,332  (_merge==2)

    matched                           700,009  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(8,332 observations deleted)

. drop _merge

. 
. merge 1:1 pid syear using "${OUT_DATA}pbrutto.dta"
(label pid already defined)
(label syear already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                       636,435
        from master                       325  (_merge==1)
        from using                    636,110  (_merge==2)

    matched                           699,684  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(636,435 observations deleted)

. drop _merge

. 
. 
. 
. * save temporary individual level data
. save "${OUT_DATA}temp.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/temp.dta saved

. 
. 
. * merge household level data
. use "${OUT_DATA}hpathl.dta", clear

. merge 1:1 hid syear using "${OUT_DATA}hl.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                       265,773
        from master                   265,773  (_merge==1)
        from using                          0  (_merge==2)

    matched                           449,274  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(265,773 observations deleted)

. drop _merge

. merge 1:1 hid syear using "${OUT_DATA}hgen.dta"
(note: variable syear was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        44,381
        from master                    44,381  (_merge==1)
        from using                          0  (_merge==2)

    matched                           404,893  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 hid syear using "${OUT_DATA}hbrutto.dta"
(label hid already defined)
(label syear already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        78,109
        from master                         2  (_merge==1)
        from using                     78,107  (_merge==2)

    matched                           449,272  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(78,109 observations deleted)

. drop _merge

. 
. * merge household and individual level data
. merge 1:m hid syear using "${OUT_DATA}temp.dta"
(label hid already defined)
(label syear already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        47,066
        from master                    45,216  (_merge==1)
        from using                      1,850  (_merge==2)

    matched                           697,834  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(47,066 observations deleted)

. drop _merge

. 
. merge 1:m pid syear using "${OUT_DATA}pequiv.dta"
(label pid already defined)
(label syear already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                       439,878
        from master                       305  (_merge==1)
        from using                    439,573  (_merge==2)

    matched                           697,529  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(439,878 observations deleted)

. drop _merge

. 
. 
. ***********************************************
. * Data Filtering
. ***********************************************
. *** 1. syear
. drop if syear < 1992
(0 observations deleted)

. 
. *** 2. keep only full-time and part-time employed individuals.
. keep if employment_percentage == "full-time" | employment_percentage == "part-time"
(338,646 observations deleted)

. gen full_time = (employment_percentage == "full-time")

. drop employment_percentage

. 
. *** 3. keep only birth year > 1964
. keep if gebjahr > 1964 & !missing(gebjahr)
(162,122 observations deleted)

. 
. *** 4. drop irregular and missing age, sex, type of employment, 
. ***    migration background, married
. keep if age>=17 & !missing(gebjahr)
(0 observations deleted)

. keep if !missing(sex) & !missing(type_employment) & !missing(age) & !missing(migback) 
> & !missing(married)
(1,328 observations deleted)

. 
. //save "${OUT_DATA}temp.dta", replace
. 
. *** 5. drop missing if_savings (first step)
. *drop if missing(if_savings)
. 
. 
. *** 6. drop changing type of employment to ensure they don't swich between treated and
>  control group
. * flag to indicate any change
. //use "${OUT_DATA}temp.dta", clear
. bysort pid (syear): gen change_flag = type_employment != type_employment[_n-1] if _n >
>  1
(44,450 missing values generated)

. * check flag and changed person
. //tab change_flag
. //bysort pid (syear): gen change = type_employment != type_employment[_n-1] if _n > 1
. //list pid syear type_employment if change == 1, sepby(pid)
. 
. /*
> *** see the trend ***
> gen change_01 = .
> gen change_10 = .
> 
> bysort pid (syear): replace change_01 = (type_employment[_n-1] == 0 & type_employment 
> == 1) if _n > 1
> bysort pid (syear): replace change_10 = (type_employment[_n-1] == 1 & type_employment 
> == 0) if _n > 1
> 
> collapse (sum) change_01 change_10 (count) pid, by(syear)
> 
> gen change_01_pct = (change_01 / pid) * 100
> gen change_10_pct = (change_10 / pid) * 100
> 
> twoway (line change_01_pct syear, lcolor(blue) lpattern(solid)) ///
>        (line change_10_pct syear, lcolor(red) lpattern(dash)), ///
>        title("Transitions in Type Employment Over Time") ///
>        legend(label(1 "0 → 1") label(2 "1 → 0")) ///
>        xtitle("Year") ytitle("Percentage of Changes") ///
>        xlabel(, angle(45))
> graph export "${OUT_OUTPUT}type_change.png", replace
> */
. 
. 
. * drop person with changed type
. replace change_flag = 0 if missing(change_flag)
(44,450 real changes made)

. egen change = max(change_flag), by(pid)

. 
. /* Count unique `pid`s where `change == 1`
> bysort pid (syear): gen count_pid = _n == 1  // Creates a unique `pid` counter
> count if count_pid == 1
> count if change == 1 & count_pid == 1
> drop change_pid
> */
. 
. drop if change == 1
(18,603 observations deleted)

. drop change change_flag

. 
. /* check
> bysort pid (syear): gen change_flag = type_employment != type_employment[_n-1] if _n >
>  1
> tab change_flag  // Should now show 0
> */
. 
. ***********************************************
. * transform sex into binary variable
. gen female = (sex == 2)

. drop sex

. order pid hid syear if_savings savings_amount type_employment female age ///
>         age_square gebjahr migback married hh_size nchild full_time years_employ educa
> tion_years ///
>         vocational_degree labor_income household_income CPI

. 
. 
. * transform nominal variables into real variables
. * savings_amount labor_income household_income
. * base year 2003: 78.1
. replace savings_amount = savings_amount * 78.1 / CPI
(116,083 real changes made)

. replace labor_income = labor_income * 78.1 / CPI
(172,584 real changes made)

. replace household_income = household_income * 78.1 / CPI
(165,410 real changes made)

. 
. ***********************************************
. * Save Data
. ***********************************************
. * save data
. save "${OUT_DATA}data.dta", replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/data.dta saved

. 
. * data with only household head
. keep if hh_head == 1
(70,637 observations deleted)

. save "${OUT_DATA}data_head.dta",replace
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/data/data_head.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/1_merge.log
  log type:  text
 closed on:  25 Jul 2025, 23:40:55
----------------------------------------------------------------------------------------
