----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/2_summary.log
  log type:  text
 opened on:  28 Jul 2025, 06:00:10

. 
. ***********************************************
. * summary statistics
. ***********************************************
. 
. 
. /*
> gen migback_1 = (migback == 1)
> gen migback_2 = (migback == 2)
> gen migback_3 = (migback == 3)
> 
> by type_employment, sort : sum if_savings savings_amount female age age_square ///
> migback_1 migback_2 migback_3 married hh_size nchild full_time years_employ education_
> years vocational_degree ///
> labor_income household_income hh_head
> 
> * the summary table is then copy pasted to the report with small adjustment.
> */
. local files data data_head

. 
. foreach file of local files {
  2. 
. use "${OUT_DATA}`file'.dta", clear
  3. 
. *** compositional change check
. * 1. define cutoff year
. local cutoff = 2006
  4. 
. * 2. Compute for each pid their first and last survey year
. egen min_year = min(syear), by(pid)
  5. egen max_year = max(syear), by(pid)
  6. 
. * 3. Create a compositional‐change indicator
. gen byte comp_status = .
  7. replace comp_status = 1 if max_year <= `cutoff'-1   // only pre‐reform
  8. replace comp_status = 2 if min_year >= `cutoff'    // only post‐reform
  9. replace comp_status = 3 if max_year >= `cutoff' & min_year <= `cutoff'-1  /// both 
> periods
> 
 10. * 4. Tabulate counts
. tab comp_status,m
 11. 
. * 5. keep only balanced heads
. keep if comp_status == 3
 12. drop comp_status
 13. 
. * Tag employees
. gen employee = (type_employment==0)
 14. gen selfemployed = (type_employment==1)
 15. 
. * To be consistent with SAVE, use only year 2003-2010
. * keep if (syear >= 2005) & (syear <=2009)
.  keep if (syear >= 2003) & (syear <=2010)
 16. *
. 
. 
. 
. 
. * gen migration background categories
. gen migback_1 = (migback == 1)
 17. gen migback_2 = (migback == 2)
 18. gen migback_3 = (migback == 3)
 19. * Collapse means and standard deviations
. collapse ///
> (mean) if_savings savings_amount female age migback_1 migback_2 migback_3 ///
>                 married hh_size nchild full_time years_employ education_years ///
>                 vocational_degree labor_income household_income hh_head ///
> (sd) sd_if_savings = if_savings ///
>     sd_savings_amount = savings_amount ///
>     sd_female = female ///
>     sd_age = age ///
>     sd_migback_1 = migback_1 ///
>     sd_migback_2 = migback_2 ///
>     sd_migback_3 = migback_3 ///
>     sd_married = married ///
>     sd_hh_size = hh_size ///
>     sd_nchild = nchild ///
>     sd_full_time = full_time ///
>     sd_years_employ = years_employ ///
>     sd_education_years = education_years ///
>     sd_vocational_degree = vocational_degree ///
>     sd_labor_income = labor_income ///
>     sd_household_income = household_income ///
>     sd_hh_head = hh_head, ///
> by(type_employment)
 20. 
. 
. * Then export
. 
. xpose, clear varname
 21. 
. 
. export excel using "${OUT}/descriptive_statistics_`file'.xlsx", ///
> sheet("original_`file'") firstrow(variables) replace
 22. 
. 
. }
(176,830 missing values generated)
(12,217 real changes made)
(110,245 real changes made)
(54,368 real changes made)

comp_status |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,217        6.91        6.91
          2 |    110,245       62.35       69.25
          3 |     54,368       30.75      100.00
------------+-----------------------------------
      Total |    176,830      100.00
(122,462 observations deleted)
(30,863 observations deleted)
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/2_summary/descriptiv
> e_statistics_data.xlsx saved
(106,193 missing values generated)
(5,417 real changes made)
(71,571 real changes made)
(29,205 real changes made)

comp_status |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,417        5.10        5.10
          2 |     71,571       67.40       72.50
          3 |     29,205       27.50      100.00
------------+-----------------------------------
      Total |    106,193      100.00
(76,988 observations deleted)
(16,414 observations deleted)
file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/2_summary/descriptiv
> e_statistics_data_head.xlsx saved

. 
. 
. 
. 
. ***********************************************
. * variables in interest
. ***********************************************
. use "${OUT_DATA}data_head.dta", clear

. 
. *** has savings
. fre if_savings

if_savings
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |      31334      29.51      30.84      30.84
        1     |      70267      66.17      69.16     100.00
        Total |     101601      95.68     100.00           
Missing .     |       4592       4.32                      
Total         |     106193     100.00                      
-----------------------------------------------------------

. 
. * To be consistent with SAVE, use only year 2003-2010
. * keep if (syear >= 2005) & (syear <=2009)
.  keep if (syear >= 2003) & (syear <=2010)
(86,704 observations deleted)

. *
. 
. ***
. summarize savings_amount if type_employment == 0,d

           [de] Hoehe Sparbetrag monatlich (Euro)
                       [harmonisiert]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 673
25%            0              0       Sum of Wgt.         673

50%     122.2278                      Mean           438.5551
                        Largest       Std. Dev.      1263.986
75%     447.8211       10784.81
90%     958.2822       13434.63       Variance        1597661
95%     1791.284       13831.17       Skewness        8.16557
99%     4478.211       16035.02       Kurtosis       83.42829

. summarize savings_amount if type_employment == 1,d

           [de] Hoehe Sparbetrag monatlich (Euro)
                       [harmonisiert]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              18,172
25%            0              0       Sum of Wgt.      18,172

50%          100                      Mean           228.8469
                        Largest       Std. Dev.      410.0778
75%     287.4847       6269.496
90%     535.5985       7165.138       Variance       168163.8
95%     898.7342       8956.422       Skewness       13.66963
99%     1797.468       23367.09       Kurtosis       596.5272

. 
. 
. *** amount saved
. drop if savings_amount > 5000
(659 observations deleted)

. 
. * Generate ECDF separately for each group
. gen rank_self = .
(18,830 missing values generated)

. gen rank_emp = .
(18,830 missing values generated)

. 
. sort type_employment savings_amount

. by type_employment (savings_amount), sort: gen n = _n

. by type_employment: gen N = _N

. by type_employment: replace rank_self = n/N if type_employment==0
(667 real changes made)

. by type_employment: replace rank_emp = n/N if type_employment==1
(18,163 real changes made)

. 
. * Plot ECDFs together
. twoway (line rank_self savings_amount if type_employment==0, sort lcolor(blue)) ///
>        (line rank_emp savings_amount if type_employment==1, sort lcolor(red)), ///
>        legend(label(1 "Self-Employed") label(2 "Employees")) ///
>        title("Empirical CDF of Monthly Amount of Savings (≤ €5000)") ///
>        xlabel(0(500)5000) ///
>        ylabel(0(.1)1, angle(0)) ///
>        ytitle("Cumulative Proportion") ///
>        xtitle("Monthly Savings Amount (€)")

. 
. graph export "${OUT}/amount saved.png", replace
(file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/2_summary/amount sa
> ved.png written in PNG format)

. 
. *** type_employment
. fre type_employment

type_employment
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |        667       3.54       3.54       3.54
        1     |      18163      96.46      96.46     100.00
        Total |      18830     100.00     100.00           
-----------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/2_summary.log
  log type:  text
 closed on:  28 Jul 2025, 06:00:15
----------------------------------------------------------------------------------------
