----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/4_did_inten_hea
> d.log
  log type:  text
 opened on:  26 May 2025, 02:54:23

. 
. 
. ***********************************************
. * Intensive Margin: log Savings
. ***********************************************
. use "${MY_DATA_OUT}data_head.dta", clear

. 
. * drop obs with data quality issue
. drop if if_savings == .
(4,592 observations deleted)

. drop if savings_amount == .
(1,207 observations deleted)

. 
. /* 
> * check
> gen if_test = (savings_amount > 0)
> tab if_test if_savings //checked
> */
. 
. tab if_savings, m

 if_savings |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,334       31.21       31.21
          1 |     69,060       68.79      100.00
------------+-----------------------------------
      Total |    100,394      100.00

. 
. * Filter people who always save
. gen has_zero = (if_savings == 0)

. bysort hid (syear): egen any_zero = max(has_zero)

. drop if any_zero == 1
(63,517 observations deleted)

. 
. 
. 
. 
. * Generate log savings
. gen log = log(savings_amount)

. 
. * Generate Post-Reform Indicator
. gen post = syear >= 2007

. 
. * Generate Interaction Term for DiD
. gen interaction = post * type_employment

. 
. 
. *** compositional change check
. * 1. define cutoff year
. local cutoff = 2007

. 
. * 2. Compute for each pid their first and last survey year
. egen min_year = min(syear), by(pid)

. egen max_year = max(syear), by(pid)

. 
. * 3. Create a compositional‐change indicator
. gen byte comp_status = .
(36,877 missing values generated)

. replace comp_status = 1 if max_year <= `cutoff'-1   // only pre‐reform
(2,115 real changes made)

. replace comp_status = 2 if min_year >= `cutoff'    // only post‐reform
(26,756 real changes made)

. replace comp_status = 3 if max_year >= `cutoff' & min_year <= `cutoff'-1  /// both per
> iods
> 
(8,006 real changes made)

. * 4. Tabulate counts
. tab comp_status,m

comp_status |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,115        5.74        5.74
          2 |     26,756       72.55       78.29
          3 |      8,006       21.71      100.00
------------+-----------------------------------
      Total |     36,877      100.00

. 
. * 5. keep only balanced heads
. * keep if comp_status == 3
. 
. 
. 
. 
. *** Linear Probability Model (LPM)
. 
. reg log interaction post type_employment, robust

Linear regression                               Number of obs     =     36,877
                                                F(3, 36873)       =     412.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0427
                                                Root MSE          =     .97859

---------------------------------------------------------------------------------
                |               Robust
            log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.3178105   .0909792    -3.49   0.000    -.4961323   -.1394888
           post |    .523257   .0900303     5.81   0.000     .3467951    .6997189
type_employment |   -.503856   .0866892    -5.81   0.000    -.6737693   -.3339428
          _cons |   6.399857    .085883    74.52   0.000     6.231524     6.56819
---------------------------------------------------------------------------------

. estimates store lpm1

. 
. reg log interaction post type_employment female age age_square i.migback ///
>         hh_size nchild, robust

Linear regression                               Number of obs     =     36,748
                                                F(10, 36737)      =     319.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0897
                                                Root MSE          =     .95445

---------------------------------------------------------------------------------
                |               Robust
            log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.2885746   .0926875    -3.11   0.002    -.4702447   -.1069046
           post |   .3880822   .0920816     4.21   0.000     .2075997    .5685647
type_employment |  -.3781059   .0885476    -4.27   0.000    -.5516617     -.20455
         female |  -.1931178   .0100751   -19.17   0.000    -.2128653   -.1733703
            age |   .0409638   .0051589     7.94   0.000     .0308521    .0510755
     age_square |  -.0003713   .0000673    -5.52   0.000    -.0005032   -.0002395
                |
        migback |
             2  |   .0053293   .0140934     0.38   0.705    -.0222943    .0329528
             3  |   .0177518   .0209625     0.85   0.397    -.0233353     .058839
                |
        hh_size |   .2265627   .0085063    26.63   0.000       .20989    .2432354
         nchild |  -.2557566   .0106789   -23.95   0.000    -.2766876   -.2348256
          _cons |   5.095146   .1311907    38.84   0.000     4.838009    5.352284
---------------------------------------------------------------------------------

. estimates store lpm2

. 
. reg log interaction post type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, robus
> t

Linear regression                               Number of obs     =     34,076
                                                F(14, 34061)      =     513.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1895
                                                Root MSE          =     .90141

-----------------------------------------------------------------------------------
                  |               Robust
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.2145862   .1015286    -2.11   0.035    -.4135857   -.0155866
             post |    .228142   .1009933     2.26   0.024     .0301917    .4260922
  type_employment |  -.4094221    .097838    -4.18   0.000    -.6011878   -.2176564
           female |   -.132374   .0111451   -11.88   0.000    -.1542188   -.1105291
              age |   .0102749   .0052737     1.95   0.051    -.0000617    .0206115
       age_square |  -.0000613   .0000671    -0.91   0.361    -.0001927    .0000701
                  |
          migback |
               2  |   .1621131   .0163458     9.92   0.000     .1300748    .1941515
               3  |   .0380312   .0201718     1.89   0.059    -.0015062    .0775687
                  |
          hh_size |   .2592685    .008551    30.32   0.000     .2425083    .2760287
           nchild |  -.2658241   .0105731   -25.14   0.000    -.2865478   -.2451004
        full_time |   .1638496   .0147868    11.08   0.000     .1348669    .1928323
     years_employ |   .0082827   .0012729     6.51   0.000     .0057878    .0107776
  education_years |   .1020288   .0023131    44.11   0.000     .0974951    .1065625
vocational_degree |  -.1635142   .0124111   -13.17   0.000    -.1878403   -.1391881
            _cons |   4.237909   .1412053    30.01   0.000     3.961142    4.514676
-----------------------------------------------------------------------------------

. estimates store lpm3

. 
. /*
> * identical to the one below
> reghdfe log interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, absor
> b(syear) vce(cluster hid)
> estimates store lpm4
> */
. 
. reg log interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, robust

Linear regression                               Number of obs     =     34,076
                                                F(43, 34032)      =     183.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2029
                                                Root MSE          =     .89431

-----------------------------------------------------------------------------------
                  |               Robust
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.1697461    .100646    -1.69   0.092    -.3670156    .0275235
  type_employment |  -.4233344   .0969355    -4.37   0.000    -.6133314   -.2333375
           female |  -.1327226   .0110716   -11.99   0.000    -.1544232   -.1110219
              age |   .0401622   .0054293     7.40   0.000     .0295206    .0508039
       age_square |  -.0004849   .0000695    -6.97   0.000    -.0006212   -.0003486
                  |
          migback |
               2  |   .1195443   .0164974     7.25   0.000     .0872089    .1518796
               3  |   .0293554   .0199867     1.47   0.142    -.0098193    .0685301
                  |
          hh_size |   .2583335   .0084933    30.42   0.000     .2416864    .2749806
           nchild |   -.251794   .0105041   -23.97   0.000    -.2723823   -.2312056
        full_time |   .1766041    .014752    11.97   0.000     .1476896    .2055186
     years_employ |   .0082664   .0012873     6.42   0.000     .0057432    .0107896
  education_years |   .1018775   .0023047    44.20   0.000     .0973601    .1063949
vocational_degree |  -.1441563   .0123767   -11.65   0.000    -.1684151   -.1198975
                  |
            syear |
            1993  |  -.1760262   .1150887    -1.53   0.126     -.401604    .0495515
            1994  |   -.095433   .1100385    -0.87   0.386    -.3111122    .1202462
            1995  |  -.1907324   .1048475    -1.82   0.069    -.3962369    .0147721
            1996  |  -.2374458   .1000846    -2.37   0.018    -.4336151   -.0412765
            1997  |  -.2136263   .1026308    -2.08   0.037    -.4147861   -.0124666
            1998  |  -.2391225   .0982654    -2.43   0.015    -.4317259    -.046519
            1999  |  -.2845813   .0961881    -2.96   0.003    -.4731133   -.0960494
            2000  |  -.3673899   .0915107    -4.01   0.000    -.5467539   -.1880258
            2001  |   -.356747   .0911657    -3.91   0.000    -.5354348   -.1780592
            2002  |   -.381802   .0915742    -4.17   0.000    -.5612905   -.2023135
            2003  |  -.4021995   .0910365    -4.42   0.000    -.5806341   -.2237648
            2004  |  -.3895249   .0906068    -4.30   0.000    -.5671173   -.2119325
            2005  |  -.3119546   .0910596    -3.43   0.001    -.4904345   -.1334747
            2006  |   -.390995   .0900869    -4.34   0.000    -.5675684   -.2144217
            2007  |   -.244597   .1342078    -1.82   0.068    -.5076488    .0184547
            2008  |    -.25834   .1341704    -1.93   0.054    -.5213184    .0046385
            2009  |  -.2554484   .1341841    -1.90   0.057    -.5184537     .007557
            2010  |  -.3415737   .1330825    -2.57   0.010    -.6024199   -.0807275
            2011  |  -.3111075   .1323818    -2.35   0.019    -.5705803   -.0516347
            2012  |  -.2892529   .1324297    -2.18   0.029    -.5488197   -.0296862
            2013  |  -.2990951   .1322668    -2.26   0.024    -.5583425   -.0398478
            2014  |  -.2185263    .132433    -1.65   0.099    -.4780995     .041047
            2015  |   -.150544   .1323397    -1.14   0.255    -.4099342    .1088463
            2016  |  -.1350338   .1325383    -1.02   0.308    -.3948133    .1247458
            2017  |  -.0817109   .1319343    -0.62   0.536    -.3403066    .1768849
            2018  |  -.1023933   .1318995    -0.78   0.438    -.3609208    .1561343
            2019  |   .0197983   .1312033     0.15   0.880    -.2373645    .2769611
            2020  |   .0141079   .1314908     0.11   0.915    -.2436185    .2718344
            2021  |   .0971999   .1321129     0.74   0.462    -.1617457    .3561456
            2022  |  -.0395684    .131247    -0.30   0.763    -.2968169    .2176801
                  |
            _cons |   4.043966   .1597232    25.32   0.000     3.730903    4.357029
-----------------------------------------------------------------------------------

. estimates store lpm4

. 
. xtset hid syear
       panel variable:  hid (unbalanced)
        time variable:  syear, 1992 to 2022, but with gaps
                delta:  1 unit

. xtreg log interaction post age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree , fe

Fixed-effects (within) regression               Number of obs     =     34,076
Group variable: hid                             Number of groups  =     10,299

R-sq:                                           Obs per group:
     within  = 0.0655                                         min =          1
     between = 0.0693                                         avg =        3.3
     overall = 0.0792                                         max =         31

                                                F(10,23767)       =     166.55
corr(u_i, Xb)  = -0.0829                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   .0428439   .0836314     0.51   0.608    -.1210789    .2067667
             post |  -.1693914    .083764    -2.02   0.043    -.3335743   -.0052086
              age |   .0497715   .0081778     6.09   0.000     .0337425    .0658006
       age_square |  -.0004597   .0000883    -5.21   0.000    -.0006328   -.0002866
          hh_size |   .1463966   .0104752    13.98   0.000     .1258646    .1669286
           nchild |  -.1591608   .0106629   -14.93   0.000    -.1800607   -.1382608
        full_time |   .1681226    .017507     9.60   0.000     .1338078    .2024374
     years_employ |   .0235364   .0044949     5.24   0.000     .0147262    .0323467
  education_years |   .0367686   .0088904     4.14   0.000     .0193428    .0541944
vocational_degree |  -.0153713    .041886    -0.37   0.714    -.0974705    .0667279
            _cons |   3.855522   .1875272    20.56   0.000     3.487956    4.223087
------------------+----------------------------------------------------------------
          sigma_u |  .95931709
          sigma_e |  .58320155
              rho |   .7301488   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(10298, 23767) = 5.66                Prob > F = 0.0000

. estimates store lpm5

. 
. xtreg log interaction age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, fe

Fixed-effects (within) regression               Number of obs     =     34,076
Group variable: hid                             Number of groups  =     10,299

R-sq:                                           Obs per group:
     within  = 0.0796                                         min =          1
     between = 0.0696                                         avg =        3.3
     overall = 0.0692                                         max =         31

                                                F(39,23738)       =      52.65
corr(u_i, Xb)  = -0.0406                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   .0412726   .0831277     0.50   0.620    -.1216629    .2042081
              age |   .0485741   .0098749     4.92   0.000     .0292187    .0679296
       age_square |  -.0009205   .0000945    -9.74   0.000    -.0011057   -.0007354
          hh_size |   .1344611   .0104473    12.87   0.000     .1139838    .1549384
           nchild |  -.1532801   .0106339   -14.41   0.000    -.1741232    -.132437
        full_time |   .1886832   .0174973    10.78   0.000     .1543874     .222979
     years_employ |   .0168693   .0045087     3.74   0.000      .008032    .0257065
  education_years |   .0352986    .008936     3.95   0.000     .0177834    .0528137
vocational_degree |   .0235551   .0418326     0.56   0.573    -.0584395    .1055497
                  |
            syear |
            1993  |  -.1984538   .0966776    -2.05   0.040    -.3879482   -.0089595
            1994  |  -.1221002   .0966861    -1.26   0.207    -.3116112    .0674107
            1995  |  -.1453363   .0954996    -1.52   0.128    -.3325216     .041849
            1996  |  -.2633754   .0959621    -2.74   0.006    -.4514672   -.0752836
            1997  |  -.1860338   .0972284    -1.91   0.056    -.3766077    .0045402
            1998  |  -.2045328   .0983512    -2.08   0.038    -.3973074   -.0117581
            1999  |  -.2201003   .1000742    -2.20   0.028    -.4162522   -.0239485
            2000  |  -.1884905   .0997401    -1.89   0.059    -.3839874    .0070064
            2001  |  -.1913624   .1025779    -1.87   0.062    -.3924217    .0096968
            2002  |   -.217235   .1054437    -2.06   0.039    -.4239114   -.0105586
            2003  |  -.2000094   .1085433    -1.84   0.065    -.4127612    .0127424
            2004  |  -.1624631   .1119346    -1.45   0.147     -.381862    .0569358
            2005  |  -.0411671   .1154324    -0.36   0.721    -.2674219    .1850878
            2006  |  -.0969308   .1187829    -0.82   0.414    -.3297528    .1358912
            2007  |  -.1281485   .1485657    -0.86   0.388    -.4193467    .1630497
            2008  |  -.1096576   .1517384    -0.72   0.470    -.4070746    .1877594
            2009  |  -.0945069   .1552119    -0.61   0.543    -.3987321    .2097183
            2010  |   -.095804   .1583845    -0.60   0.545    -.4062478    .2146397
            2011  |    .013673   .1619815     0.08   0.933    -.3038211    .3311671
            2012  |   .0452569   .1657511     0.27   0.785     -.279626    .3701397
            2013  |   .0844971   .1696442     0.50   0.618    -.2480162    .4170105
            2014  |   .1680123    .173693     0.97   0.333    -.1724372    .5084617
            2015  |   .2294215   .1776467     1.29   0.197    -.1187773    .5776203
            2016  |   .2806115   .1818176     1.54   0.123    -.0757626    .6369856
            2017  |   .3743874   .1859125     2.01   0.044      .009987    .7387877
            2018  |   .3988721   .1902128     2.10   0.036     .0260429    .7717013
            2019  |   .4901165   .1945652     2.52   0.012     .1087564    .8714767
            2020  |   .5007939   .1990381     2.52   0.012     .1106664    .8909213
            2021  |     .63393   .2034254     3.12   0.002     .2352032    1.032657
            2022  |   .5069504   .2081104     2.44   0.015     .0990407    .9148602
                  |
            _cons |   4.298762   .2154137    19.96   0.000     3.876537    4.720987
------------------+----------------------------------------------------------------
          sigma_u |   .9540824
          sigma_e |  .57912898
              rho |  .73075365   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(10298, 23738) = 5.63                Prob > F = 0.0000

. estimates store lpm6

. 
. *bacon log interaction, id(hid) time(syear) gen(weight estimate g1 g2)
. 
. * equivlent to below dyn, but dyn is faster
. *did_multiplegt_old log hid syear interaction, cluster(hid)
. did_multiplegt (dyn) log hid syear interaction, cluster(hid) placebo(1)


--------------------------------------------------------------------------------
             Estimation of treatment effects: Event-study effects
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N  Switchers 
-------------+------------------------------------------------------------------
    Effect_1 | -.0471398   .3756944  -.7834874   .6892077       4949        532 
--------------------------------------------------------------------------------


--------------------------------------------------------------------------------
               Average cumulative (total) effect per treatment unit
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N     Switch 
-------------+------------------------------------------------------------------
  Av_tot_eff | -.0471398   .3756944  -.7834874   .6892077       4949        532 

             | x Periods 
-------------+-----------
  Av_tot_eff |           
--------------------------------------------------------------------------------
Average number of time periods over which a treatment's effect is accumulated = 1


--------------------------------------------------------------------------------
          Testing the parallel trends and no anticipation assumptions
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N  Switchers 
-------------+------------------------------------------------------------------
   Placebo_1 |  .0868001   .3793643  -.6567402   .8303404       2174        381 
--------------------------------------------------------------------------------


The development of this package was funded by the European Union (ERC, REALLYCREDIBLE,GA
>  N°101043899).

. graph export "${MY_OUTPUT_OUT}did_multiplegt.png", replace
(file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inten_head/did_mu
> ltiplegt.png written in PNG format)

. 
. *estimates store lpm7
. 
. 
. 
. 
. * Display Results Side-by-Side
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_amount.txt", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Effect of the 2006 Pension Reform on Amount Saved") ///
>     label
(note: file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inten_head/
> did_amount.txt not found)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inte
> n_head/did_amount.txt)

. 
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_amount.tex", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Effect of the 2006 Pension Reform on Amount Saved") ///
>     label booktabs drop(*.syear)
(note: file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inten_head/
> did_amount.tex not found)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inte
> n_head/did_amount.tex)

. 
.         
.         
. 
. 
. 
. ***********************************************
. * Intensive Margin: saving rate
. ***********************************************
. 
. /* check
> tab household_income if household_income < 10, m
> tab savings_amount if savings_amount < 10, m
> tab household_income if household_income ==.
> */
. 
. drop if household_income == 0
(9 observations deleted)

. drop if household_income == .
(818 observations deleted)

. 
. gen rate = savings_amount/household_income

. 
. tab rate if rate>1

       rate |      Freq.     Percent        Cum.
------------+-----------------------------------
   1.066667 |          1        5.56        5.56
   1.076923 |          1        5.56       11.11
      1.125 |          1        5.56       16.67
       1.25 |          2       11.11       27.78
   1.333333 |          1        5.56       33.33
   1.666667 |          2       11.11       44.44
   1.785714 |          1        5.56       50.00
          2 |          1        5.56       55.56
   2.333333 |          1        5.56       61.11
        2.5 |          2       11.11       72.22
   2.857143 |          1        5.56       77.78
   5.555556 |          1        5.56       83.33
   5.833333 |          1        5.56       88.89
          7 |          1        5.56       94.44
       8.75 |          1        5.56      100.00
------------+-----------------------------------
      Total |         18      100.00

. drop if rate > 1
(18 observations deleted)

. sum rate, d

                            rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0172414       .0001667
 5%     .0333333          .0002
10%     .0454545       .0002174       Obs              36,032
25%     .0769231       .0003125       Sum of Wgt.      36,032

50%     .1333333                      Mean           .1704365
                        Largest       Std. Dev.      .1294104
75%     .2272727              1
90%     .3529412              1       Variance       .0167471
95%     .4347826              1       Skewness       1.516526
99%           .6              1       Kurtosis       5.720981

. 
. 
. 
. *** Linear Probability Model (LPM)
. 
. reg rate interaction post type_employment, robust

Linear regression                               Number of obs     =     36,032
                                                F(3, 36028)       =      91.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0127
                                                Root MSE          =     .12859

---------------------------------------------------------------------------------
                |               Robust
           rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.0092981   .0145202    -0.64   0.522     -.037758    .0191618
           post |   .0123042   .0144096     0.85   0.393    -.0159389    .0405474
type_employment |   -.054016   .0139634    -3.87   0.000    -.0813846   -.0266474
          _cons |   .2183517   .0138686    15.74   0.000     .1911689    .2455345
---------------------------------------------------------------------------------

. estimates store lpm1

. 
. reg rate interaction post type_employment female age age_square i.migback ///
>         hh_size nchild, robust

Linear regression                               Number of obs     =     35,913
                                                F(10, 35902)      =     172.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0514
                                                Root MSE          =     .12609

---------------------------------------------------------------------------------
                |               Robust
           rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.0110174   .0142437    -0.77   0.439    -.0389355    .0169006
           post |   .0221755     .01417     1.56   0.118    -.0055981     .049949
type_employment |  -.0543185   .0136912    -3.97   0.000    -.0811536   -.0274835
         female |  -.0230493   .0013332   -17.29   0.000    -.0256624   -.0204361
            age |  -.0007507   .0007129    -1.05   0.292     -.002148    .0006467
     age_square |   9.76e-06   9.24e-06     1.06   0.291    -8.35e-06    .0000279
                |
        migback |
             2  |   .0150373   .0019202     7.83   0.000     .0112735     .018801
             3  |  -.0025567   .0027721    -0.92   0.356    -.0079901    .0028768
                |
        hh_size |   -.012074   .0010467   -11.54   0.000    -.0141255   -.0100225
         nchild |  -.0066122   .0012543    -5.27   0.000    -.0090707   -.0041537
          _cons |   .2700605   .0191281    14.12   0.000     .2325689     .307552
---------------------------------------------------------------------------------

. estimates store lpm2

. 
. reg rate interaction post type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, robus
> t

Linear regression                               Number of obs     =     33,368
                                                F(14, 33353)      =     210.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0878
                                                Root MSE          =     .12321

-----------------------------------------------------------------------------------
                  |               Robust
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0058123     .01574    -0.37   0.712    -.0366632    .0250385
             post |   .0091087   .0156696     0.58   0.561    -.0216043    .0398217
  type_employment |  -.0594859   .0152147    -3.91   0.000    -.0893074   -.0296645
           female |  -.0208087   .0015502   -13.42   0.000    -.0238471   -.0177703
              age |  -.0026082   .0007497    -3.48   0.001    -.0040776   -.0011387
       age_square |   .0000308   9.53e-06     3.23   0.001     .0000121    .0000495
                  |
          migback |
               2  |   .0233918   .0021828    10.72   0.000     .0191135    .0276701
               3  |  -.0014799   .0027872    -0.53   0.595    -.0069429    .0039831
                  |
          hh_size |  -.0092993    .001062    -8.76   0.000    -.0113808   -.0072178
           nchild |  -.0085271   .0012603    -6.77   0.000    -.0109974   -.0060569
        full_time |   .0048489    .001875     2.59   0.010     .0011739    .0085239
     years_employ |   .0003158   .0001632     1.93   0.053    -4.14e-06    .0006357
  education_years |   .0075476   .0003122    24.17   0.000     .0069356    .0081596
vocational_degree |  -.0186756   .0016958   -11.01   0.000    -.0219995   -.0153518
            _cons |   .2136097   .0209362    10.20   0.000      .172574    .2546455
-----------------------------------------------------------------------------------

. estimates store lpm3

. 
. /* identical to the one below
> reghdfe rate interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, absor
> b(syear) vce(cluster hid)
> estimates store lpm4
> */
. 
. reg rate interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, robust

Linear regression                               Number of obs     =     33,368
                                                F(43, 33324)      =      77.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0977
                                                Root MSE          =      .1226

-----------------------------------------------------------------------------------
                  |               Robust
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   .0012896   .0155841     0.08   0.934    -.0292558     .031835
  type_employment |  -.0631058   .0150549    -4.19   0.000    -.0926139   -.0335977
           female |  -.0210095   .0015446   -13.60   0.000     -.024037   -.0179821
              age |   .0005879   .0007713     0.76   0.446    -.0009239    .0020997
       age_square |  -.0000128   9.89e-06    -1.29   0.197    -.0000322    6.61e-06
                  |
          migback |
               2  |   .0198706    .002209     9.00   0.000     .0155409    .0242003
               3  |  -.0023534   .0027699    -0.85   0.396    -.0077826    .0030758
                  |
          hh_size |  -.0097203   .0010607    -9.16   0.000    -.0117994   -.0076412
           nchild |  -.0072012   .0012613    -5.71   0.000    -.0096734   -.0047291
        full_time |   .0061495   .0018745     3.28   0.001     .0024754    .0098236
     years_employ |      .0002   .0001641     1.22   0.223    -.0001217    .0005217
  education_years |   .0075807   .0003115    24.33   0.000     .0069701    .0081913
vocational_degree |  -.0167121   .0016919    -9.88   0.000    -.0200282   -.0133959
                  |
            syear |
            1993  |  -.0314513   .0224472    -1.40   0.161    -.0754487     .012546
            1994  |  -.0213908   .0206447    -1.04   0.300    -.0618551    .0190735
            1995  |  -.0296208   .0197038    -1.50   0.133    -.0682409    .0089993
            1996  |  -.0445571   .0186491    -2.39   0.017    -.0811099   -.0080042
            1997  |  -.0394993   .0187973    -2.10   0.036    -.0763427   -.0026559
            1998  |   -.040994   .0184313    -2.22   0.026      -.07712    -.004868
            1999  |  -.0534545   .0180783    -2.96   0.003    -.0888885   -.0180204
            2000  |   -.059179    .017476    -3.39   0.001    -.0934326   -.0249253
            2001  |   -.058932   .0173554    -3.40   0.001    -.0929491   -.0249148
            2002  |  -.0729107   .0173061    -4.21   0.000    -.1068313   -.0389902
            2003  |  -.0685872   .0172805    -3.97   0.000    -.1024576   -.0347167
            2004  |  -.0718992   .0173004    -4.16   0.000    -.1058086   -.0379899
            2005  |  -.0582663   .0174283    -3.34   0.001    -.0924263   -.0241063
            2006  |  -.0681216   .0172612    -3.95   0.000    -.1019541   -.0342891
            2007  |  -.0734172   .0231125    -3.18   0.001    -.1187185   -.0281158
            2008  |   -.073492   .0231082    -3.18   0.001    -.1187849   -.0281991
            2009  |  -.0690751   .0231647    -2.98   0.003    -.1144788   -.0236714
            2010  |  -.0752737   .0229941    -3.27   0.001     -.120343   -.0302045
            2011  |  -.0674508    .022952    -2.94   0.003    -.1124375   -.0224641
            2012  |  -.0673255   .0229768    -2.93   0.003    -.1123608   -.0222902
            2013  |  -.0670317   .0229404    -2.92   0.003    -.1119956   -.0220678
            2014  |  -.0618312   .0229775    -2.69   0.007    -.1068678   -.0167945
            2015  |  -.0533724    .022998    -2.32   0.020    -.0984493   -.0082956
            2016  |  -.0556589    .022996    -2.42   0.016    -.1007318   -.0105859
            2017  |  -.0470999     .02296    -2.05   0.040    -.0921024   -.0020974
            2018  |   -.052396   .0229354    -2.28   0.022    -.0973501   -.0074418
            2019  |  -.0387069   .0229036    -1.69   0.091    -.0835989     .006185
            2020  |  -.0398304   .0229173    -1.74   0.082    -.0847491    .0050883
            2021  |  -.0243353    .022983    -1.06   0.290    -.0693828    .0207122
            2022  |  -.0533129   .0228697    -2.33   0.020    -.0981382   -.0084876
                  |
            _cons |    .217324   .0262096     8.29   0.000     .1659523    .2686957
-----------------------------------------------------------------------------------

. estimates store lpm4

. 
. xtset hid syear
       panel variable:  hid (unbalanced)
        time variable:  syear, 1992 to 2022, but with gaps
                delta:  1 unit

. xtreg rate interaction post age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree, fe

Fixed-effects (within) regression               Number of obs     =     33,368
Group variable: hid                             Number of groups  =     10,077

R-sq:                                           Obs per group:
     within  = 0.0152                                         min =          1
     between = 0.0349                                         avg =        3.3
     overall = 0.0316                                         max =         31

                                                F(10,23281)       =      35.98
corr(u_i, Xb)  = -0.0315                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0177045   .0127105    -1.39   0.164     -.042618     .007209
             post |   .0093539   .0127299     0.73   0.462    -.0155976    .0343053
              age |  -.0035217   .0012015    -2.93   0.003    -.0058766   -.0011667
       age_square |   .0000327    .000013     2.52   0.012     7.23e-06    .0000581
          hh_size |  -.0110171    .001543    -7.14   0.000    -.0140415   -.0079927
           nchild |  -.0041134   .0015711    -2.62   0.009     -.007193   -.0010339
        full_time |   .0125473   .0025732     4.88   0.000     .0075038    .0175909
     years_employ |   .0027767   .0006591     4.21   0.000     .0014848    .0040687
  education_years |   .0032509   .0013121     2.48   0.013     .0006791    .0058228
vocational_degree |   .0000595   .0061498     0.01   0.992    -.0119946    .0121135
            _cons |   .2007181    .027558     7.28   0.000     .1467027    .2547336
------------------+----------------------------------------------------------------
          sigma_u |  .12477754
          sigma_e |  .08484092
              rho |  .68384721   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(10076, 23281) = 4.74                Prob > F = 0.0000

. estimates store lpm5

. 
. xtreg rate interaction age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, fe

Fixed-effects (within) regression               Number of obs     =     33,368
Group variable: hid                             Number of groups  =     10,077

R-sq:                                           Obs per group:
     within  = 0.0274                                         min =          1
     between = 0.0577                                         avg =        3.3
     overall = 0.0485                                         max =         31

                                                F(39,23252)       =      16.77
corr(u_i, Xb)  = -0.0587                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0164945    .012651    -1.30   0.192    -.0412912    .0083022
              age |  -.0022184   .0014504    -1.53   0.126    -.0050614    .0006245
       age_square |  -9.67e-06   .0000139    -0.70   0.486    -.0000369    .0000175
          hh_size |  -.0127232    .001541    -8.26   0.000    -.0157437   -.0097028
           nchild |  -.0029251   .0015689    -1.86   0.062    -.0060004    .0001501
        full_time |   .0147954   .0025754     5.74   0.000     .0097475    .0198433
     years_employ |   .0015811   .0006619     2.39   0.017     .0002838    .0028785
  education_years |   .0034921   .0013215     2.64   0.008      .000902    .0060823
vocational_degree |    .004337   .0061507     0.71   0.481    -.0077187    .0163927
                  |
            syear |
            1993  |  -.0322826   .0140857    -2.29   0.022    -.0598914   -.0046737
            1994  |  -.0273888   .0140903    -1.94   0.052    -.0550068    .0002291
            1995  |  -.0271334   .0139834    -1.94   0.052    -.0545418     .000275
            1996  |  -.0500868   .0140067    -3.58   0.000     -.077541   -.0226327
            1997  |  -.0356881   .0142061    -2.51   0.012    -.0635329   -.0078432
            1998  |  -.0392558   .0143669    -2.73   0.006     -.067416   -.0110957
            1999  |  -.0452418   .0146167    -3.10   0.002    -.0738915   -.0165922
            2000  |  -.0415578   .0145886    -2.85   0.004    -.0701524   -.0129631
            2001  |  -.0446223   .0149875    -2.98   0.003    -.0739989   -.0152457
            2002  |  -.0544152   .0154175    -3.53   0.000    -.0846345   -.0241958
            2003  |  -.0498269   .0158684    -3.14   0.002      -.08093   -.0187238
            2004  |  -.0515704   .0163635    -3.15   0.002     -.083644   -.0194968
            2005  |  -.0333177    .016881    -1.97   0.048    -.0664056   -.0002297
            2006  |  -.0397537   .0173661    -2.29   0.022    -.0737925    -.005715
            2007  |  -.0263031   .0220342    -1.19   0.233    -.0694916    .0168855
            2008  |  -.0240314   .0224928    -1.07   0.285    -.0681187    .0200559
            2009  |  -.0209281   .0230009    -0.91   0.363    -.0660115    .0241552
            2010  |  -.0228777   .0234657    -0.97   0.330     -.068872    .0231166
            2011  |  -.0076957    .023986    -0.32   0.748    -.0547098    .0393184
            2012  |  -.0069783   .0245371    -0.28   0.776    -.0550726    .0411161
            2013  |  -.0025153   .0251077    -0.10   0.920    -.0517281    .0466975
            2014  |   .0013405    .025695     0.05   0.958    -.0490234    .0517045
            2015  |   .0085248   .0262682     0.32   0.746    -.0429626    .0600123
            2016  |   .0093063   .0268744     0.35   0.729    -.0433693    .0619818
            2017  |   .0209912   .0274692     0.76   0.445    -.0328503    .0748327
            2018  |   .0198062   .0280958     0.70   0.481    -.0352635    .0748758
            2019  |   .0292931   .0287283     1.02   0.308    -.0270164    .0856025
            2020  |   .0269709   .0293808     0.92   0.359    -.0306174    .0845591
            2021  |   .0455588   .0300204     1.52   0.129    -.0132832    .1044008
            2022  |   .0164163   .0307083     0.53   0.593    -.0437741    .0766067
                  |
            _cons |   .2298082   .0316644     7.26   0.000     .1677439    .2918725
------------------+----------------------------------------------------------------
          sigma_u |  .12330746
          sigma_e |  .08436926
              rho |  .68112692   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(10076, 23252) = 4.74                Prob > F = 0.0000

. estimates store lpm6

. 
. 
. * Display Results Side-by-Side
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_rate.txt", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Effect of the 2006 Pension Reform on Saving Rate") ///
>     label
(note: file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inten_head/
> did_rate.txt not found)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inte
> n_head/did_rate.txt)

. 
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_rate.tex", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Effect of the 2006 Pension Reform on Saving Rate") ///
>     label booktabs drop(*.syear)
(note: file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inten_head/
> did_rate.tex not found)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/4_inte
> n_head/did_rate.tex)

. 
. log close
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/4_did_inten_hea
> d.log
  log type:  text
 closed on:  26 May 2025, 02:55:25
----------------------------------------------------------------------------------------
