----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/5_did_inten_pla
> cebo.log
  log type:  text
 opened on:  26 May 2025, 08:33:13

. 
. 
. ***********************************************
. * Intensive Margin: log Savings
. ***********************************************
. use "${MY_DATA_OUT}data_head.dta", clear

. 
. * drop obs with data quality issue
. drop if if_savings == .
(4,592 observations deleted)

. drop if savings_amount == .
(1,207 observations deleted)

. 
. /* 
> * check
> gen if_test = (savings_amount > 0)
> tab if_test if_savings //checked
> */
. 
. tab if_savings, m

 if_savings |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,334       31.21       31.21
          1 |     69,060       68.79      100.00
------------+-----------------------------------
      Total |    100,394      100.00

. 
. * Filter people who always save
. gen has_zero = (if_savings == 0)

. bysort hid (syear): egen any_zero = max(has_zero)

. drop if any_zero == 1
(63,517 observations deleted)

. 
. 
. 
. 
. * Generate log savings
. gen log = log(savings_amount)

. 
. * Generate Post-Reform Indicator
. gen post = syear >= 2000

. 
. * Generate Interaction Term for DiD
. gen interaction = post * type_employment

. 
. 
. *** compositional change check
. * 1. define cutoff year
. local cutoff = 2000

. 
. * 2. Compute for each pid their first and last survey year
. egen min_year = min(syear), by(pid)

. egen max_year = max(syear), by(pid)

. 
. * 3. Create a compositional‐change indicator
. gen byte comp_status = .
(36,877 missing values generated)

. replace comp_status = 1 if max_year <= `cutoff'-1   // only pre‐reform
(544 real changes made)

. replace comp_status = 2 if min_year >= `cutoff'    // only post‐reform
(32,955 real changes made)

. replace comp_status = 3 if max_year >= `cutoff' & min_year <= `cutoff'-1  /// both per
> iods
> 
(3,378 real changes made)

. * 4. Tabulate counts
. tab comp_status,m

comp_status |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        544        1.48        1.48
          2 |     32,955       89.36       90.84
          3 |      3,378        9.16      100.00
------------+-----------------------------------
      Total |     36,877      100.00

. 
. * 5. keep only balanced heads
. keep if comp_status == 3
(33,499 observations deleted)

. 
. 
. 
. 
. *** Linear Probability Model (LPM)
. 
. reg log interaction post type_employment, robust

Linear regression                               Number of obs     =      3,378
                                                F(3, 3374)        =      14.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0088
                                                Root MSE          =     .81579

---------------------------------------------------------------------------------
                |               Robust
            log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.1221776   .2326007    -0.53   0.599    -.5782302     .333875
           post |   .2897402   .2306926     1.26   0.209    -.1625713    .7420516
type_employment |   .1190995    .072941     1.63   0.103    -.0239136    .2621126
          _cons |   5.781407   .0687951    84.04   0.000     5.646523    5.916291
---------------------------------------------------------------------------------

. estimates store lpm1

. 
. reg log interaction post type_employment female age age_square i.migback ///
>         hh_size nchild, robust

Linear regression                               Number of obs     =      3,341
                                                F(10, 3330)       =      43.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0808
                                                Root MSE          =     .78882

---------------------------------------------------------------------------------
                |               Robust
            log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |   .1252225   .2315632     0.54   0.589    -.3287981    .5792431
           post |  -.0987639   .2313774    -0.43   0.670      -.55242    .3548923
type_employment |   -.122509   .0397245    -3.08   0.002     -.200396   -.0446221
         female |  -.1214189   .0282867    -4.29   0.000    -.1768799   -.0659579
            age |   .0546202   .0167291     3.26   0.001     .0218199    .0874205
     age_square |  -.0005979   .0002165    -2.76   0.006    -.0010223   -.0001734
                |
        migback |
             2  |  -.2299972   .0667462    -3.45   0.001    -.3608649   -.0991296
             3  |   .0827866   .0607118     1.36   0.173    -.0362496    .2018228
                |
        hh_size |   .3223445   .0254395    12.67   0.000     .2724659    .3722231
         nchild |  -.4177421   .0342713   -12.19   0.000     -.484937   -.3505471
          _cons |     4.5149   .3209563    14.07   0.000     3.885608    5.144191
---------------------------------------------------------------------------------

. estimates store lpm2

. 
. reg log interaction post type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, robus
> t

Linear regression                               Number of obs     =      3,234
                                                F(14, 3219)       =      56.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1981
                                                Root MSE          =     .73859

-----------------------------------------------------------------------------------
                  |               Robust
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   .3686767   .2755891     1.34   0.181    -.1716711    .9090245
             post |  -.4040671   .2765355    -1.46   0.144    -.9462707    .1381364
  type_employment |  -.3344623   .0709391    -4.71   0.000    -.4735527    -.195372
           female |  -.0853174   .0306718    -2.78   0.005    -.1454557   -.0251791
              age |  -.0115169   .0166298    -0.69   0.489     -.044123    .0210892
       age_square |   -.000222   .0002118    -1.05   0.295    -.0006372    .0001933
                  |
          migback |
               2  |  -.1983179   .0672217    -2.95   0.003    -.3301196   -.0665162
               3  |   .1765273   .0545333     3.24   0.001     .0696038    .2834509
                  |
          hh_size |     .33738    .023365    14.44   0.000     .2915682    .3831919
           nchild |  -.3911052   .0312026   -12.53   0.000    -.4522842   -.3299262
        full_time |  -.1467857   .0488597    -3.00   0.003     -.242585   -.0509864
     years_employ |   .0375318   .0058711     6.39   0.000     .0260203    .0490433
  education_years |   .1410762   .0073676    19.15   0.000     .1266305    .1555219
vocational_degree |  -.0223925   .0364248    -0.61   0.539    -.0938106    .0490257
            _cons |   4.365983   .3344883    13.05   0.000     3.710152    5.021815
-----------------------------------------------------------------------------------

. estimates store lpm3

. 
. /*
> * identical to the one below
> reghdfe log interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, absor
> b(syear) vce(cluster hid)
> estimates store lpm4
> */
. 
. reg log interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, robust

Linear regression                               Number of obs     =      3,234
                                                F(43, 3190)       =      19.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2050
                                                Root MSE          =     .73876

-----------------------------------------------------------------------------------
                  |               Robust
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   .3375319   .2752466     1.23   0.220    -.2021463      .87721
  type_employment |  -.3235105   .0879769    -3.68   0.000    -.4960075   -.1510136
           female |  -.0845699   .0309118    -2.74   0.006     -.145179   -.0239609
              age |   .0316332   .0211978     1.49   0.136    -.0099295    .0731959
       age_square |  -.0008406   .0003012    -2.79   0.005    -.0014311   -.0002501
                  |
          migback |
               2  |  -.1939754   .0673011    -2.88   0.004    -.3259332   -.0620177
               3  |   .1711095   .0565632     3.03   0.003     .0602056    .2820134
                  |
          hh_size |   .3398898   .0231291    14.70   0.000     .2945404    .3852392
           nchild |  -.3925976   .0312087   -12.58   0.000    -.4537887   -.3314065
        full_time |  -.1520731   .0486493    -3.13   0.002    -.2474603    -.056686
     years_employ |   .0381074   .0058343     6.53   0.000      .026668    .0495468
  education_years |   .1408652   .0073759    19.10   0.000     .1264033    .1553272
vocational_degree |  -.0234485   .0365876    -0.64   0.522    -.0951861    .0482891
                  |
            syear |
            1993  |   .0436243   .1520827     0.29   0.774    -.2545654     .341814
            1994  |   .0028152   .1444125     0.02   0.984    -.2803355     .285966
            1995  |   .0344107   .1345464     0.26   0.798    -.2293955     .298217
            1996  |  -.0770534   .1304807    -0.59   0.555    -.3328878    .1787811
            1997  |   -.034377   .1334416    -0.26   0.797     -.296017    .2272631
            1998  |   -.047116   .1267171    -0.37   0.710    -.2955712    .2013391
            1999  |  -.0843897   .1243803    -0.68   0.498    -.3282632    .1594839
            2000  |  -.3694823    .304515    -1.21   0.225    -.9665473    .2275827
            2001  |  -.3786174   .3018761    -1.25   0.210    -.9705083    .2132735
            2002  |  -.5059693   .3032058    -1.67   0.095    -1.100467    .0885288
            2003  |  -.4718318   .3023027    -1.56   0.119    -1.064559    .1208956
            2004  |  -.4242833   .3030882    -1.40   0.162    -1.018551    .1699841
            2005  |  -.3537886   .3063344    -1.15   0.248    -.9544209    .2468436
            2006  |   -.413129    .308925    -1.34   0.181    -1.018841    .1925827
            2007  |  -.4698736   .3110459    -1.51   0.131    -1.079744    .1399966
            2008  |  -.5194542   .3097505    -1.68   0.094    -1.126785    .0878762
            2009  |  -.5414666    .311071    -1.74   0.082    -1.151386    .0684528
            2010  |  -.5268641   .3160151    -1.67   0.096    -1.146477    .0927493
            2011  |  -.3726531   .3188159    -1.17   0.243    -.9977579    .2524518
            2012  |  -.4608747    .316192    -1.46   0.145    -1.080835    .1590853
            2013  |  -.3918899   .3247455    -1.21   0.228    -1.028621    .2448411
            2014  |  -.3838268   .3284253    -1.17   0.243    -1.027773    .2601194
            2015  |  -.4266126   .3285147    -1.30   0.194    -1.070734    .2175088
            2016  |  -.3833277   .3386144    -1.13   0.258    -1.047252    .2805963
            2017  |  -.3387382   .3397718    -1.00   0.319    -1.004931     .327455
            2018  |  -.3313273   .3474568    -0.95   0.340    -1.012589    .3499341
            2019  |  -.3298019   .3573636    -0.92   0.356    -1.030488    .3708838
            2020  |  -.1602384   .3553392    -0.45   0.652    -.8569549    .5364781
            2021  |  -.1329638   .3796094    -0.35   0.726     -.877267    .6113394
            2022  |   .1008251    .395814     0.25   0.799    -.6752505    .8769006
                  |
            _cons |   3.675917    .399195     9.21   0.000     2.893213    4.458622
-----------------------------------------------------------------------------------

. estimates store lpm4

. 
. xtset hid syear
       panel variable:  hid (unbalanced)
        time variable:  syear, 1992 to 2022, but with gaps
                delta:  1 unit

. xtreg log interaction post age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree , fe

Fixed-effects (within) regression               Number of obs     =      3,234
Group variable: hid                             Number of groups  =        281

R-sq:                                           Obs per group:
     within  = 0.0756                                         min =          1
     between = 0.0404                                         avg =       11.5
     overall = 0.0054                                         max =         31

                                                F(10,2943)        =      24.07
corr(u_i, Xb)  = -0.5672                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   -.041536   .3868579    -0.11   0.915    -.8000755    .7170035
             post |   .1185606   .3863243     0.31   0.759    -.6389326    .8760537
              age |  -.0612373   .0204958    -2.99   0.003    -.1014249   -.0210497
       age_square |  -.0000947   .0002163    -0.44   0.662    -.0005188    .0003294
          hh_size |   .1873036   .0280918     6.67   0.000      .132222    .2423851
           nchild |  -.2566933   .0286927    -8.95   0.000    -.3129532   -.2004335
        full_time |  -.0540671   .0559624    -0.97   0.334    -.1637966    .0556624
     years_employ |   .0858882   .0129451     6.63   0.000     .0605057    .1112706
  education_years |  -.0480514     .02985    -1.61   0.108    -.1065804    .0104776
vocational_degree |    -.02565   .0938466    -0.27   0.785    -.2096617    .1583617
            _cons |   7.553113   .5425553    13.92   0.000     6.489287     8.61694
------------------+----------------------------------------------------------------
          sigma_u |  .78944268
          sigma_e |  .57142234
              rho |  .65619815   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(280, 2943) = 8.86                   Prob > F = 0.0000

. estimates store lpm5

. 
. xtreg log interaction age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, fe
note: 2022.syear omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,234
Group variable: hid                             Number of groups  =        281

R-sq:                                           Obs per group:
     within  = 0.0933                                         min =          1
     between = 0.0299                                         avg =       11.5
     overall = 0.0029                                         max =         31

                                                F(38,2915)        =       7.89
corr(u_i, Xb)  = -0.5909                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
              log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |   -.084996   .3854656    -0.22   0.825    -.8408085    .6708166
              age |   .0427602    .030295     1.41   0.158    -.0166416     .102162
       age_square |  -.0013822   .0003105    -4.45   0.000    -.0019911   -.0007733
          hh_size |   .1900231   .0281639     6.75   0.000     .1347998    .2452463
           nchild |  -.2552451   .0288882    -8.84   0.000    -.3118884   -.1986017
        full_time |  -.0474919   .0558667    -0.85   0.395    -.1570342    .0620503
     years_employ |   .0948394   .0130923     7.24   0.000     .0691683    .1205105
  education_years |  -.0543411   .0298208    -1.82   0.069    -.1128131    .0041309
vocational_degree |   -.019004   .0935655    -0.20   0.839    -.2024652    .1644573
                  |
            syear |
            1993  |  -.1276376   .1214117    -1.05   0.293     -.365699    .1104238
            1994  |  -.1234148    .118464    -1.04   0.298    -.3556965    .1088669
            1995  |  -.1676468   .1161978    -1.44   0.149    -.3954848    .0601912
            1996  |   -.304449    .118359    -2.57   0.010    -.5365246   -.0723733
            1997  |  -.2898435   .1208077    -2.40   0.016    -.5267207   -.0529663
            1998  |  -.3402124   .1256854    -2.71   0.007    -.5866535   -.0937713
            1999  |  -.3830239   .1337446    -2.86   0.004    -.6452674   -.1207804
            2000  |    -.17242   .2968428    -0.58   0.561     -.754463    .4096229
            2001  |  -.2286802   .2861372    -0.80   0.424    -.7897317    .3323714
            2002  |  -.3564142   .2749216    -1.30   0.195    -.8954744     .182646
            2003  |  -.3430512   .2634679    -1.30   0.193    -.8596532    .1735508
            2004  |   -.319503   .2528223    -1.26   0.206    -.8152315    .1762255
            2005  |  -.2799032   .2421223    -1.16   0.248    -.7546514     .194845
            2006  |  -.3514308   .2314706    -1.52   0.129    -.8052933    .1024318
            2007  |   -.446112   .2213563    -2.02   0.044    -.8801426   -.0120813
            2008  |  -.4928919    .211481    -2.33   0.020    -.9075593   -.0782245
            2009  |  -.5258871   .2018935    -2.60   0.009    -.9217554   -.1300189
            2010  |  -.5377728    .192734    -2.79   0.005    -.9156814   -.1598642
            2011  |   -.396621   .1844979    -2.15   0.032    -.7583805   -.0348615
            2012  |  -.4989655   .1756885    -2.84   0.005    -.8434517   -.1544793
            2013  |  -.4535625   .1691506    -2.68   0.007    -.7852293   -.1218956
            2014  |  -.4245934   .1629131    -2.61   0.009    -.7440299   -.1051569
            2015  |  -.4917479   .1553257    -3.17   0.002    -.7963071   -.1871887
            2016  |  -.4196402   .1525906    -2.75   0.006    -.7188364    -.120444
            2017  |   -.399341    .146517    -2.73   0.006    -.6866283   -.1120538
            2018  |  -.3643092   .1443406    -2.52   0.012    -.6473291   -.0812892
            2019  |  -.3289052   .1438438    -2.29   0.022    -.6109509   -.0468596
            2020  |  -.1798755   .1430184    -1.26   0.209    -.4603028    .1005518
            2021  |  -.1443967   .1575922    -0.92   0.360    -.4534001    .1646066
            2022  |          0  (omitted)
                  |
            _cons |   5.960986   .6937779     8.59   0.000     4.600641     7.32133
------------------+----------------------------------------------------------------
          sigma_u |  .80803384
          sigma_e |  .56864658
              rho |  .66878383   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(280, 2915) = 8.99                   Prob > F = 0.0000

. estimates store lpm6

. 
. *bacon log interaction, id(hid) time(syear) gen(weight estimate g1 g2)
. 
. * equivlent to below dyn, but dyn is faster
. *did_multiplegt_old log hid syear interaction, cluster(hid)
. did_multiplegt (dyn) log hid syear interaction, cluster(hid) placebo(1)

Placebo_1 cannot be estimated.
There is no switcher or no control
for this placebo.


--------------------------------------------------------------------------------
             Estimation of treatment effects: Event-study effects
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N  Switchers 
-------------+------------------------------------------------------------------
    Effect_1 | -2.172551   2.305888  -6.692009   2.346907        215        214 
--------------------------------------------------------------------------------


--------------------------------------------------------------------------------
               Average cumulative (total) effect per treatment unit
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N     Switch 
-------------+------------------------------------------------------------------
  Av_tot_eff | -2.172551   2.305889   -6.69201   2.346907        215        214 

             | x Periods 
-------------+-----------
  Av_tot_eff |           
--------------------------------------------------------------------------------
Average number of time periods over which a treatment's effect is accumulated = 1


--------------------------------------------------------------------------------
          Testing the parallel trends and no anticipation assumptions
--------------------------------------------------------------------------------

             |  Estimate         SE      LB CI      UB CI          N  Switchers 
-------------+------------------------------------------------------------------
   Placebo_1 |         0          0          0          0          0        170 
--------------------------------------------------------------------------------


The development of this package was funded by the European Union (ERC, REALLYCREDIBLE,GA
>  N°101043899).

. graph export "${MY_OUTPUT_OUT}did_multiplegt.png", replace
(file /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/5_placebo/did_multi
> plegt.png written in PNG format)

. 
. *estimates store lpm7
. 
. 
. 
. 
. * Display Results Side-by-Side
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_amount.txt", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Placebo Test on Amount Saved") ///
>     label
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/5_plac
> ebo/did_amount.txt)

. 
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_amount.tex", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Placebo Test on Amount Saved") ///
>     label booktabs drop(*.syear)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/5_plac
> ebo/did_amount.tex)

. 
.         
.         
. 
. 
. 
. ***********************************************
. * Intensive Margin: saving rate
. ***********************************************
. 
. /* check
> tab household_income if household_income < 10, m
> tab savings_amount if savings_amount < 10, m
> tab household_income if household_income ==.
> */
. 
. drop if household_income == 0
(0 observations deleted)

. drop if household_income == .
(35 observations deleted)

. 
. gen rate = savings_amount/household_income

. 
. tab rate if rate>1
no observations

. drop if rate > 1
(0 observations deleted)

. sum rate, d

                            rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0217391       .0071429
 5%     .0397772            .01
10%     .0529595       .0111111       Obs               3,343
25%     .0842697       .0115556       Sum of Wgt.       3,343

50%     .1333333                      Mean           .1599718
                        Largest       Std. Dev.      .1061563
75%      .202934       .6363636
90%     .3061225       .6941879       Variance       .0112692
95%     .3849624       .7407407       Skewness       1.426249
99%           .5       .8140063       Kurtosis       5.455941

. 
. 
. 
. *** Linear Probability Model (LPM)
. 
. reg rate interaction post type_employment, robust

Linear regression                               Number of obs     =      3,343
                                                F(3, 3339)        =       6.98
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0065
                                                Root MSE          =     .10586

---------------------------------------------------------------------------------
                |               Robust
           rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.0326151   .0439408    -0.74   0.458    -.1187687    .0535386
           post |    .013933   .0437423     0.32   0.750    -.0718314    .0996974
type_employment |   .0378206   .0268185     1.41   0.159    -.0147618    .0904029
          _cons |   .1353255   .0265769     5.09   0.000     .0832168    .1874341
---------------------------------------------------------------------------------

. estimates store lpm1

. 
. reg rate interaction post type_employment female age age_square i.migback ///
>         hh_size nchild, robust

Linear regression                               Number of obs     =      3,306
                                                F(10, 3295)       =      18.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0435
                                                Root MSE          =     .10395

---------------------------------------------------------------------------------
                |               Robust
           rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
    interaction |  -.0312775   .0428207    -0.73   0.465    -.1152354    .0526804
           post |   .0277849   .0428182     0.65   0.516     -.056168    .1117378
type_employment |   .0281225   .0243083     1.16   0.247    -.0195384    .0757834
         female |  -.0072476    .003776    -1.92   0.055    -.0146511    .0001558
            age |   .0010588   .0022069     0.48   0.631    -.0032682    .0053858
     age_square |  -.0000197   .0000281    -0.70   0.483    -.0000748    .0000353
                |
        migback |
             2  |   -.008071   .0084586    -0.95   0.340    -.0246556    .0085135
             3  |   .0021037   .0082444     0.26   0.799     -.014061    .0182683
                |
        hh_size |  -.0048371   .0028886    -1.67   0.094    -.0105008    .0008265
         nchild |  -.0178515   .0037329    -4.78   0.000    -.0251706   -.0105325
          _cons |   .1488076   .0481046     3.09   0.002     .0544896    .2431255
---------------------------------------------------------------------------------

. estimates store lpm2

. 
. reg rate interaction post type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, robus
> t

Linear regression                               Number of obs     =      3,200
                                                F(14, 3185)       =      26.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1011
                                                Root MSE          =     .10008

-----------------------------------------------------------------------------------
                  |               Robust
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0198806   .0456047    -0.44   0.663    -.1092982     .069537
             post |   .0104575   .0457403     0.23   0.819    -.0792258    .1001409
  type_employment |   .0113853   .0246618     0.46   0.644    -.0369693    .0597398
           female |  -.0048597   .0043181    -1.13   0.260    -.0133262    .0036068
              age |  -.0040927   .0021884    -1.87   0.062    -.0083835    .0001982
       age_square |   .0000258   .0000279     0.92   0.355    -.0000289    .0000805
                  |
          migback |
               2  |  -.0057893    .008588    -0.67   0.500    -.0226278    .0110492
               3  |   .0112651   .0077684     1.45   0.147    -.0039665    .0264967
                  |
          hh_size |  -.0029289   .0028097    -1.04   0.297    -.0084379      .00258
           nchild |  -.0166773   .0035876    -4.65   0.000    -.0237116    -.009643
        full_time |  -.0155738   .0065153    -2.39   0.017    -.0283485   -.0027991
     years_employ |   .0015079   .0007505     2.01   0.045     .0000365    .0029794
  education_years |   .0123474    .000949    13.01   0.000     .0104867    .0142081
vocational_degree |   .0102783   .0049132     2.09   0.037      .000645    .0199117
            _cons |   .1097852   .0493261     2.23   0.026     .0130711    .2064993
-----------------------------------------------------------------------------------

. estimates store lpm3

. 
. /* identical to the one below
> reghdfe rate interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree, absor
> b(syear) vce(cluster hid)
> estimates store lpm4
> */
. 
. reg rate interaction type_employment female age age_square i.migback ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, robust

Linear regression                               Number of obs     =      3,200
                                                F(43, 3156)       =       9.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1117
                                                Root MSE          =     .09994

-----------------------------------------------------------------------------------
                  |               Robust
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0238125   .0442121    -0.54   0.590    -.1104999    .0628749
  type_employment |   .0145071   .0239786     0.61   0.545    -.0325081    .0615223
           female |  -.0048326   .0043468    -1.11   0.266    -.0133555    .0036903
              age |   .0023767   .0028003     0.85   0.396    -.0031138    .0078673
       age_square |  -.0000667    .000039    -1.71   0.087    -.0001432    9.73e-06
                  |
          migback |
               2  |  -.0055848   .0085335    -0.65   0.513    -.0223165    .0111469
               3  |   .0107795   .0080267     1.34   0.179    -.0049586    .0265177
                  |
          hh_size |  -.0029359   .0028065    -1.05   0.296    -.0084386    .0025668
           nchild |  -.0164106   .0036317    -4.52   0.000    -.0235313   -.0092899
        full_time |  -.0163837   .0064923    -2.52   0.012    -.0291133   -.0036542
     years_employ |   .0015792   .0007409     2.13   0.033     .0001264     .003032
  education_years |   .0122941   .0009486    12.96   0.000     .0104342    .0141541
vocational_degree |    .010081   .0049362     2.04   0.041     .0004026    .0197595
                  |
            syear |
            1993  |   .0092666   .0264599     0.35   0.726    -.0426138    .0611469
            1994  |  -.0023288   .0209434    -0.11   0.911    -.0433929    .0387353
            1995  |  -.0001718    .019747    -0.01   0.993    -.0388901    .0385464
            1996  |  -.0210026   .0185681    -1.13   0.258    -.0574093    .0154041
            1997  |  -.0089946   .0190355    -0.47   0.637    -.0463178    .0283286
            1998  |  -.0033289    .018639    -0.18   0.858    -.0398747     .033217
            1999  |  -.0162237   .0178656    -0.91   0.364    -.0512531    .0188057
            2000  |   .0155676   .0483984     0.32   0.748    -.0793279     .110463
            2001  |   .0147911   .0477101     0.31   0.757    -.0787549    .1083371
            2002  |  -.0133836   .0479001    -0.28   0.780    -.1073022    .0805349
            2003  |  -.0075178   .0477838    -0.16   0.875    -.1012083    .0861726
            2004  |  -.0014979   .0481281    -0.03   0.975    -.0958634    .0928677
            2005  |   .0135711   .0484106     0.28   0.779    -.0813483    .1084906
            2006  |     .00699   .0485948     0.14   0.886    -.0882907    .1022707
            2007  |   .0028792   .0485957     0.06   0.953    -.0924032    .0981615
            2008  |  -.0059989   .0486427    -0.12   0.902    -.1013735    .0893757
            2009  |   -.011789   .0487124    -0.24   0.809    -.1073002    .0837222
            2010  |  -.0061235   .0488761    -0.13   0.900    -.1019555    .0897086
            2011  |   .0135169   .0496053     0.27   0.785    -.0837449    .1107788
            2012  |  -.0043169   .0492551    -0.09   0.930    -.1008922    .0922584
            2013  |   .0041081   .0500807     0.08   0.935     -.094086    .1023022
            2014  |   .0070495   .0506691     0.14   0.889    -.0922982    .1063972
            2015  |   .0001815   .0506374     0.00   0.997    -.0991041    .0994671
            2016  |    .009525   .0510584     0.19   0.852     -.090586    .1096361
            2017  |   .0203241   .0516303     0.39   0.694    -.0809082    .1215564
            2018  |   .0212656   .0519826     0.41   0.683    -.0806575    .1231887
            2019  |   .0248106   .0529256     0.47   0.639    -.0789616    .1285827
            2020  |   .0409832   .0530826     0.77   0.440    -.0630967     .145063
            2021  |   .0586684   .0561714     1.04   0.296    -.0514678    .1688045
            2022  |   .0636684   .0577055     1.10   0.270    -.0494757    .1768124
                  |
            _cons |   .0081362   .0571575     0.14   0.887    -.1039334    .1202059
-----------------------------------------------------------------------------------

. estimates store lpm4

. 
. xtset hid syear
       panel variable:  hid (unbalanced)
        time variable:  syear, 1992 to 2022, but with gaps
                delta:  1 unit

. xtreg rate interaction post age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree, fe

Fixed-effects (within) regression               Number of obs     =      3,200
Group variable: hid                             Number of groups  =        281

R-sq:                                           Obs per group:
     within  = 0.0532                                         min =          1
     between = 0.0279                                         avg =       11.4
     overall = 0.0015                                         max =         31

                                                F(10,2909)        =      16.35
corr(u_i, Xb)  = -0.5737                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0663027    .053681    -1.24   0.217    -.1715593     .038954
             post |   .0658426   .0535954     1.23   0.219    -.0392461    .1709314
              age |  -.0140568   .0028433    -4.94   0.000     -.019632   -.0084816
       age_square |   .0000566   .0000299     1.89   0.059    -2.06e-06    .0001153
          hh_size |   -.009754   .0038816    -2.51   0.012    -.0173649   -.0021431
           nchild |   -.007617   .0039593    -1.92   0.054    -.0153803    .0001464
        full_time |  -.0004109   .0077141    -0.05   0.958    -.0155366    .0147148
     years_employ |   .0102541   .0018039     5.68   0.000     .0067171    .0137911
  education_years |  -.0054428   .0041176    -1.32   0.186    -.0135164    .0026309
vocational_degree |   .0038918   .0129396     0.30   0.764    -.0214799    .0292635
            _cons |    .548072   .0750063     7.31   0.000     .4010012    .6951429
------------------+----------------------------------------------------------------
          sigma_u |  .09857097
          sigma_e |  .07867716
              rho |  .61084078   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(280, 2909) = 8.04                   Prob > F = 0.0000

. estimates store lpm5

. 
. xtreg rate interaction age age_square ///
>         hh_size nchild full_time years_employ education_years vocational_degree i.syea
> r, fe
note: 2022.syear omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      3,200
Group variable: hid                             Number of groups  =        281

R-sq:                                           Obs per group:
     within  = 0.0769                                         min =          1
     between = 0.0291                                         avg =       11.4
     overall = 0.0009                                         max =         31

                                                F(38,2881)        =       6.31
corr(u_i, Xb)  = -0.6004                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
             rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      interaction |  -.0734156   .0533297    -1.38   0.169    -.1779837    .0311525
              age |   .0033557   .0041721     0.80   0.421     -.004825    .0115363
       age_square |  -.0001458   .0000428    -3.40   0.001    -.0002298   -.0000618
          hh_size |  -.0100235   .0038809    -2.58   0.010    -.0176332   -.0024138
           nchild |  -.0067866   .0039754    -1.71   0.088    -.0145816    .0010084
        full_time |   .0006518   .0076782     0.08   0.932    -.0144036    .0157072
     years_employ |   .0114549   .0018183     6.30   0.000     .0078897    .0150201
  education_years |  -.0061695    .004102    -1.50   0.133    -.0142126    .0018736
vocational_degree |   .0045482   .0128629     0.35   0.724    -.0206732    .0297696
                  |
            syear |
            1993  |  -.0190572   .0166716    -1.14   0.253    -.0517467    .0136324
            1994  |  -.0278133   .0162734    -1.71   0.088    -.0597221    .0040954
            1995  |  -.0387324   .0160556    -2.41   0.016     -.070214   -.0072507
            1996  |  -.0583571   .0162902    -3.58   0.000    -.0902988   -.0264155
            1997  |   -.054615    .016661    -3.28   0.001    -.0872837   -.0219463
            1998  |  -.0586839   .0173177    -3.39   0.001    -.0926402   -.0247276
            1999  |  -.0726111   .0184289    -3.94   0.000    -.1087462    -.036476
            2000  |   .0117609   .0410637     0.29   0.775    -.0687563    .0922782
            2001  |    .003168   .0395743     0.08   0.936    -.0744288    .0807647
            2002  |  -.0252367   .0380325    -0.66   0.507    -.0998104    .0493369
            2003  |  -.0257463   .0364419    -0.71   0.480    -.0972011    .0457085
            2004  |  -.0245597   .0349619    -0.70   0.482    -.0931124    .0439931
            2005  |  -.0151181   .0334739    -0.45   0.652    -.0807533    .0505171
            2006  |  -.0252024   .0319938    -0.79   0.431    -.0879353    .0375306
            2007  |  -.0355246   .0305945    -1.16   0.246     -.095514    .0244647
            2008  |  -.0463045   .0292255    -1.58   0.113    -.1036094    .0110004
            2009  |  -.0521574   .0278842    -1.87   0.062    -.1068324    .0025176
            2010  |  -.0492577   .0266428    -1.85   0.065    -.1014986    .0029831
            2011  |  -.0326926   .0254952    -1.28   0.200    -.0826833     .017298
            2012  |  -.0537939   .0242548    -2.22   0.027    -.1013524   -.0062353
            2013  |  -.0519845   .0233628    -2.23   0.026    -.0977941    -.006175
            2014  |  -.0453813   .0225597    -2.01   0.044     -.089616   -.0011465
            2015  |  -.0565953   .0214959    -2.63   0.009    -.0987441   -.0144465
            2016  |  -.0424739   .0210042    -2.02   0.043    -.0836586   -.0012891
            2017  |  -.0374204   .0201572    -1.86   0.063    -.0769443    .0021036
            2018  |  -.0342923   .0198438    -1.73   0.084    -.0732019    .0046172
            2019  |  -.0266101   .0197649    -1.35   0.178    -.0653649    .0121447
            2020  |  -.0120286   .0196438    -0.61   0.540    -.0505458    .0264887
            2021  |   .0003878   .0216368     0.02   0.986    -.0420373     .042813
            2022  |          0  (omitted)
                  |
            _cons |   .2762273   .0954059     2.90   0.004     .0891566    .4632979
------------------+----------------------------------------------------------------
          sigma_u |  .10097602
          sigma_e |  .07806482
              rho |   .6259046   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(280, 2881) = 8.22                   Prob > F = 0.0000

. estimates store lpm6

. 
. 
. * Display Results Side-by-Side
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_rate.txt", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Placebo Test on Saving Rate") ///
>     label
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/5_plac
> ebo/did_rate.txt)

. 
. esttab lpm1 lpm2 lpm3 lpm4 lpm5 lpm6 using "${MY_OUTPUT_OUT}did_rate.tex", ///
>     replace se b(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     title("Intensive Margin: Placebo Test on Saving Rate") ///
>     label booktabs drop(*.syear)
(output written to /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/output/5_plac
> ebo/did_rate.tex)

. 
. log close
      name:  <unnamed>
       log:  /Users/angelxu/Desktop/thesis/data/SOEP/reform analysis/log/5_did_inten_pla
> cebo.log
  log type:  text
 closed on:  26 May 2025, 08:33:23
----------------------------------------------------------------------------------------
